micropython/micropython/ports/raspberrypi/boards/cytron_motion_2350_pro/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Cytron MOTION 2350 Pro"
#define MICROPY_HW_MCU_NAME "rp2350"

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO16)

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO18)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO19)
#define DEFAULT_SPI_BUS_MISO (&pin_GPIO16)
